[
  {
    "term": "binary",
    "html": "The word binary comes from the latin <em>bini-</em> (meaning <em>two</em>), and <em>-ary</em> (meaning <em>part of</em>). Binary refers to the base-2 number system where all numerals are expressed using the digits zero <code>0</code> and one <code>1</code>.",
    "also": ["octal", "decimal", "hexadecimal"]
  },
  {
    "term": "octal",
    "html": "The word octal comes from the Latin <em>oct-</em> (meaning <em>eight</em>). Octal refers to the base-8 number system which consists of the digits zero <code>0</code> through seven <code>7</code>.",
    "also": ["binary", "decimal", "hexadecimal"]
  },
  {
    "term": "decimal",
    "html": "The word decimal comes from the Latin <em>deci-</em> (meaning <em>tenth</em>). Decimal refers to the base-10 number system which consists of the digits zero <code>0</code> through nine <code>9</code>.",
    "also": ["binary", "octal", "hexadecimal"]
  },
  {
    "term": "hexadecimal",
    "html": "Hexadecimal comes from the Latin <em>hex-</em> (meaning <em>six</em>) and <em>-deci-</em> (meaning <em>tenth</em>). Hexadecimal refers to the base-16 number system which consists of the <em>numeric</em> digits zero <code>0</code> through nine <code>9</code> as well as an additional six <em>alphabetic</em> digits - <code>A</code>, <code>B</code>, <code>C</code>, <code>D</code>, <code>E</code>, <code>F</code>",
    "also": ["binary", "octal", "decimal"]
  },
  {
    "term": "bit",
    "html": "A bit is a <em>binary</em> digit, which is the smallest unit of information. A bit always occupies one of two states, meaning a bit can either be zero <code>0</code> or one <code>1</code>, low or high, off or on, false or true respectively.",
    "also": ["binary", "byte"]
  },
  {
    "term": "memory",
    "html": "Memory is a term describing where computers store information, usually in the form of <em>bits</em> and <em>bytes</em>.",
    "also": ["bit", "byte"]
  },
  {
    "term": "volatile memory",
    "html": "Volatile memory is a kind of <em>memory</em> that requires active power to store information, meaning that volatile memory <em>cannot</em> survive a power cycle. Volatile memory is often used where speed is critical since it is typically faster than <em>persistent storage</em>.",
    "also": ["memory", "persistent memory"]
  },
  {
    "term": "persistent memory",
    "html": "Persistent memory is a kind of <em>memory</em> that <em>does not</em> require active power to store information, meaning that persistent memory <em>can</em> survive a power cycle. Persistent memory is usually not used in speed critical applications since it is typically slower than <em>volatile memory</em>.",
    "also": ["memory", "volatile memory"]
  },
  {
    "term": "byte",
    "html": "A byte is a grouping of eight <code>8</code> bits and it is the smallest <em>addressable</em> unit of <em>memory</em> in a modern computer.",
    "also": ["memory", "bit", "memory address"]
  },
  {
    "term": "memory address",
    "html": "A memory address is a <em>binary</em> number (usually 32-<em>bits</em> or 64-<em>bits</em>), which describes the location of a <em>byte</em> in <em>memory</em>.",
    "also": ["binary", "bit", "byte", "memory"]
  },
  {
    "term": "program",
    "html": "A program is a sequence of instructions written to be executed by a computer."
  },
  {
    "term": "hardware",
    "html": "Hardware are the physical components that comprise a computer."
  },
  {
    "term": "software",
    "html": "Software are the <em>programs</em> that a computer executes.",
    "also": ["program"]
  },
  {
    "term": ["series", "serial"],
    "html": "Processing data in <em>series</em> means to process the data <em>sequentially</em>, or one at a time.",
    "also": ["parallel", "concurrent"]
  },
  {
    "term": ["parallel", "concurrent"],
    "html": "Processing data in <em>parallel</em> means to process the data <em>simultaneously</em>, or at the same time.",
    "also": ["series", "serial"]
  },
  {
    "term": ["cpu", "central processing unit"],
    "html": "A CPU or <em>central processing unit</em> is <em>hardware</em> optimized to execute instructions in <em>series</em>.",
    "also": ["hardware", "series"]
  },
  {
    "term": "gpu",
    "html": "A GPU or <em>graphics processing unit</em> is <em>hardware</em> optimized to execute instructions in <em>parallel</em>.",
    "also": ["hardware", "parallel"]
  },
  {
    "term": "read",
    "html": "Reading is the process of copying a value from <em>memory</em> to the <em>CPU</em>.",
    "also": ["memory", "cpu", "write"]
  },
  {
    "term": "write",
    "html": "Writing is the process of copying a value from the <em>CPU</em> to <em>memory</em>.",
    "also": ["memory", "cpu", "read"]
  },
  {
    "term": "mutable",
    "html": "Mutable means that something can change or mutate. When programming, data marked as mutable <em>can</em> be changed meaning it is both <em>readable</em> and <em>writable</em>.",
    "also": ["read", "write", "immutable"]
  },
  {
    "term": "immutable",
    "html": "Immutable means that something cannot change or mutate. When programming, data marked as immutable <em>cannot</em> be changed meaning it is <em>readable</em>, but not <em>writable</em>.",
    "also": ["mutable"]
  },
  {
    "term": "random access",
    "html": "Memory described as having random access means that <em>read</em> operations take roughly the same time regardless of their location.",
    "also": ["read", "memory"]
  },
  {
    "term": "ram",
    "html": "RAM or <em>random access memory</em> is a kind of <em>volatile memory</em> that stores information via electric switches. Because there are no moving parts or magnets, RAM is incredibly fast.",
    "also": ["random access", "memory", "volatile memory"]
  }, 
  {
    "term": "hdd",
    "html": "An HDD or <em>hard disk drive</em> is a kind of <em>persistent memory</em> that stores information on a spinning disk using a magnetic head. Because the disk has to be physically moved to read or write to certain locations, an HDD <em>is not</em> a form of <em>random access memory</em>.",
    "also": ["memory", "persistent memory", "volatile memory", "random access"]
  },
  {
    "term": "ssd",
    "html": "An SSD or <em>solid state drive</em> is a kind of <em>persistent memory</em> that stores information via magnetic switches. Because there are no moving parts, an SSD <em>is</em> a form of <em>random access memory</em>.",
    "also": ["memory", "persistent memory", "volatile memory", "random access"]
  },
  {
    "term": "odd",
    "html": "An ODD or <em>optical disk drive</em> is a kind of <em>persistent memory</em> that stores information on a spinning disk using a laser. Because the disk has to be physically moved to read or write to certain locations, an ODD <em>is not</em> a form of <em>random access memory</em>."
  },
  {
    "term": "programming language",
    "html": "A programming language is a collection of <em>grammar</em> and <em>syntax</em> used to write programs. A programming language is the interface between a programmer and a computer that allows them to communicate.",
    "also": ["grammar", "syntax"]
  },
  {
    "term": "syntax",
    "html": "Syntax refers to the symbols that comprise a programming language. A <em>syntax error</em> occurs when a symbol is unrecognized or used incorrectly.",
    "also": ["grammar", "programming language"]
  },
  {
    "term": "grammar",
    "html": "Grammar refers to the rules which govern how the symbols of a programming language are arranged.",
    "also": ["syntax", "programming language"]
  },
  {
    "term": "reserved word",
    "html": "Reserved words are special symbols that cannot be used by the programmer to name functions, variables or otherwise. In JavaScript, some examples of reserved words include <code>import</code>, <code>function</code>, <code>var</code>, <code>let</code>, <code>const</code>, <code>if</code>, <code>else</code>, <code>new</code>, <code>for</code>, <code>while</code>, <code>return</code>, <code>break</code>, <code>continue</code>...",
    "also": ["syntax", "programming language"]
  },
  {
    "term": ["machine code", "machine language"],
    "html": "Machine code or machine language is a programming language written in binary for a specific hardware platform. Programmers rarely write machine code directly, but instead use a higher-level programming language to generate machine code.",
    "also": ["programming language", "binary"]
  },
  {
    "term": "assembly language",
    "html": "An assembly language is a programming language that substitutes the binary instructions of a machine language with human-readable shorthand. Assembly language is translated into machine code ahead of time by an <em>assembler</em>.",
    "also": ["programming language", "machine code", "assembler"]
  },
  {
    "term": "assembler",
    "html": "An assembler is a program that <em>consumes</em> an assembly language and translates it to machine code ahead of time.",
    "also": ["programming language", "assembly language", "machine code"]
  },
  {
    "term": "compiled language",
    "html": "A compiled language is a programming language that is translated into machine code ahead of time by a compiler. Compiled languages tend to be more abstract than an assembly language, but they are usually easier for humans to read and write. Examples of compiled languages include C, C++, Odin, Rust, and Zig.",
    "also": ["programming language", "machine code", "compiler"]
  },
  {
    "term": "compiler",
    "html": "A compiler is a program that consumes a compiled language and translates it into machine code ahead of time.",
    "also": ["programming language", "compiled language", "machine code"]
  },
  {
    "term": "interpreted language",
    "html": "An interpreted language is a programming language that is translated into machine code in realtime by an interpreter. Examples of interpreted languages include JavaScript, Ruby, and Python.",
    "also": ["programming language", "machine code", "interpreter"]
  },
  {
    "term": "interpreter",
    "html": "An interpreter is a program that consumes an interpreted language and translates it into machine code in realtime.",
    "also": ["programming language", "interpreted language", "machine code"]
  },
  {
    "term": "virtual machine language",
    "html": "A virtual machine language is a combination of both a compiled language and an interpreted language. A virtual machine language is first compiled to an intermediate language (usually known as bytecode, or virtual assembly), then it is interpreted by a virtual machine at runtime. Examples of virtual machine languages include Java, C#, and Kotlin.",
    "also": ["programming language", "compiled language", "interpreted language", "virtual machine"]
  },
  {
    "term": "virtual machine",
    "html": "A virtual machine is a special type of interpreter that consumes an intermediate language (usually known as bytecode, or virtual assembly) and translates it into machine code.",
    "also": ["programming language", "virtual machine language", "machine code"]
  },
  {
    "term": ["ide", "integrated development environment"],
    "html": "An IDE or <em>integrated development environment</em> is a special editor for writing and testing programs.",
    "also": ["programming language"]
  },
  {
    "term": "iterable",
    "html": "Something iterable can be consumed one element at a time. Think of an iterable like a deck of cards where each card is a single element.",
    "also": ["iterator"]
  },
  {
    "term": "iterator",
    "html": "An iterator consumes or produces one element at a time.",
    "also": ["iterable"]
  },
  {
    "term": "comment",
    "html": "Comments are a way to include arbitrary text in your program that isn't interpreted as code. Comments are often used to leave notes in your code for your future self or other programmers.",
    "also": ["programming language"]
  },
  {
    "term": "variable",
    "html": "A variable is one way to store and access data in a program. Think of a variable as a box that holds a value.",
    "also": ["programming language"]
  },
  {
    "term": "statement",
    "html": "A statement refers to a single instruction in a program.",
    "also": ["program"]
  },  
  {
    "term": "control flow",
    "html": "Control flow describes the order in which a program executes its instructions.",
    "also": ["program"]
  },
  {
    "term": "expression",
    "html": "An expression is a <em>statement</em> or part of a <em>statement</em> that can be evaluated to a single <em>value</em>.",
    "also": ["statement", "evaluate"]
  },
  {
    "term": ["evaluate", "evaluation"],
    "html": "Evaluation refers to the process of reducing an expression to a single value.",
    "also": ["expression"]
  },
  {
    "term": "condition",
    "html": "A condition is an expression that evaluates to either <code>true</code> or <code>false</code>.",
    "also": ["expression", "evaluate"]
  },
  {
    "term": "function",
    "html": "A function is a reusable block of code. Think of a function like a recipe that can be defined once and then reused multiple times throughout a program.",
    "also": ["programming language"]
  },
  {
    "term": "parameter",
    "html": "A parameter is part of a function definition that describes inputs to the function. Think of a parameter like a <em>placeholder</em> which is replaced with a value when the function is called.",
    "also": ["function"]
  },
  {
    "term": "argument",
    "html": "An argument is a value that is passed to a function when it is called. An argument replaces a parameter in the function definition when the function is called.",
    "also": ["function"]
  },
  {
    "term": "data type",
    "html": "A data type describes how certain binary data should be interpreted by a program.",
    "also": ["programming language"]
  },
  {
    "term": "integer",
    "html": "An integer is a data type that represents a whole number, meaning a number without a fractional part.",
    "also": ["data type"]
  },
  {
    "term": "float",
    "html": "A float is a data type that represents a number with a fractional part, usually defined using the IEEE 754 standard for floating point numbers.",
    "also": ["data type"]
  },
  {
    "term": "boolean",
    "html": "A boolean is a data type that can be either <code>true</code> or <code>false</code>.",
    "also": ["data type"]
  },
  {
    "term": "character",
    "html": "A character is an <em>integer</em> that represents a single letter, number, or symbol.",
    "also": ["data type", "integer"]
  },
  {
    "term": "string",
    "html": "A string is a data type that represents a sequence of characters. The default character encoding of a string depends on the implementation of the programming language.",
    "also": ["data type", "character"]
  },
  {
    "term": "array",
    "html": "An array is a data type that represents a sequence of values. In many programming languages, arrays are zero-indexed meaning the first element of an array is at index <code>0</code>.",
    "also": ["data type"]
  },
  {
    "term": "object",
    "html": "An object is a data type that represents a bundle of both state and behavior.",
    "also": ["data type"]
  },
  {
    "term": "null",
    "html": "The keyword <code>null</code> is used by many languages to represent the absence of a value.",
    "also": ["data type", "programming language"]
  },
  {
    "term": "voltage",
    "html": "Water is often used as an analogy for electricity. In this analogy the voltage of a circuit (measured in volts) is compared to water pressure in a pipe where more voltage corresponds to more pressure.",
    "also": ["electricity", "volts"]
  },
  {
    "term": "resistance",
    "html": "Water is often used as an analogy for electricity. In this analogy the resistance of a circuit (measured in ohms) is compared to the diameter of a pipe where more resistance corresponds to a smaller pipe.",
    "also": ["electricity", "ohms"]
  },
  {
    "term": "current",
    "html": "Water is often used as an analogy for electricity. In this analogy the current of a circuit (measured in amps) is compared to the speed of water in a pipe, where more amperage corresponds to faster water.",
    "also": ["electricity", "amps"]
  },
  {
    "term": "ampere",
    "html": "An ampere, often referred to simply as an amp, is the basic unit of electrical current. One ampere is equivalent to the voltage of a circuit divided by the resistance.",
    "also": ["current", "amp", "voltage", "resistance"]
  },
  {
    "term": "volt",
    "html": "A volt is the basic unit of electrical voltage. One volt is equivalent to one amp (current) times one ohm (resistance).",
    "also": ["voltage", "amp", "ohm"]
  },
  {
    "term": "ohm",
    "html": "An ohm is the basic unit of electrical resistance. One ohm is equivalent to one volt divided by one amp.",
    "also": ["resistance", "volt", "amp"]
  },
  {
    "term": ["ac", "alternating current"],
    "html": "Alternating Current, often referred to as simply AC, is a kind of electrical current where the voltage alternates between positive and negative at regular intervals.",
    "also": ["direct current", "electricity", "current"]
  },
  {
    "term": ["dc", "direct current"],
    "html": "Direct Current, often referred to as simply DC, is a kind of electrical current where the voltage remains (roughly) constant.",
    "also": ["alternating current", "electricity", "current"]
  },
  {
    "term": "electricity",
    "html": "The term <em>electricity</em> from the Greek <em>Elektra</em> refers to the flow of negatively charged <em>electrons</em> through a conductor.",
    "also": ["electron"]
  },
  {
    "term": "electron",
    "html": "An electron is a negatively charged subatomic particle. The movement of electrons is what creates the moving electromagnetic field we call electricity.",
    "also": ["electricity"]
  },
  {
    "term": "magnet",
    "html": "A magnet is a material that produces a magnetic field. Magnets are commonly used in electric motors and generators.",
    "also": ["electricity", "electrical", "magnetism"]
  },
  {
    "term": "electromagnetism",
    "html": "Electromagnetism describes the relationship between electric and magnetic fields. Every electric field has a corresponding magnetic field, and vice versa. This relationship is why magnets can induce electric currents in conductors, and why electric currents can produce magnetic fields.",
    "also": ["electricity", "magnetism"]
  },
  {
    "term": "charge",
    "html": "Charge refers to the amount of electricity stored in a material. Electric charge is measured in Coulombs (C).",
    "also": ["electricity", "coulomb"]
  },
  {
    "term": "capacitance",
    "html": "Capacitance refers to the ability of a material to store electric charge. Materials with high capacitance require more electric charge to reflect a meaningful change in their voltage. Electric capacitance is measured in Farads (F).",
    "also": ["electricity", "capacitor", "farad"]
  },
  {
    "term": "coulomb",
    "html": "A Coulomb is a unit of electric charge. One Coulomb is equal to the electric charge delivered by one Ampere of current in one second.",
    "also": ["charge", "electron"]
  },
  {
    "term": "farad",
    "html": "A Farad is a unit of electric capacitance. One Farad is equal to one Coulomb of charge per Volt of voltage.",
    "also": ["capacitance", "coulomb", "volt"]
  },
  {
    "term": "motor",
    "html": "A motor is a device that converts electrical energy into mechanical energy. A motor typically consists of a stationary <em>stator</em> and a rotating <em>rotor</em>.",
    "also": ["electricity", "electrical", "generator", "stator", "rotor"]
  },
  {
    "term": "generator",
    "html": "A generator is a device that converts mechanical energy into electrical energy. A generator typically consists of a stationary <em>stator</em> and a rotating <em>rotor</em>.",
    "also": ["electricity", "electrical", "motor", "stator", "rotor"]
  },
  {
    "term": "stator",
    "html": "A stator is the stationary part of a <em>motor</em> or <em>generator</em>. A stator typically contains a series of evenly spaced <em>windings</em> (made from a conductor like copper) or <em>permanent magnets</em>. In a motor, the stator's magnetic field is used to motivate the rotot. In a generator, the stator windings are used to transform the rotating magnetic field of the rotor into electrical energy.",
    "also": ["electricity", "electrical", "motor", "generator"]
  },
  {
    "term": "rotor",
    "html": "A rotor is the rotating part of a <em>motor</em> or <em>generator</em>. A rotor typically contains a series of evenly spaced <em>windings</em> (made from a conductor like copper) or <em>permanent magnets</em>. In a motor, the rotor is motivated by the magnetic field of the stator. In a generator, the rotation of the rotor magnets induces an electrical current in the stator windings.",
    "also": ["electricity", "electrical", "motor", "generator"]
  },
  {
    "term": "led",
    "html": "An LED or <em>light-emitting diode</em> is a type of <em>diode</em> that emits light when current flows through it. LEDs are commonly used in electronic displays, lighting, and indicators.",
    "also": ["diode", "light", "electricity", "electrical"]
  },
  {
    "term": "diode",
    "html": "A diode is a type of <em>electronic component</em> that allows current to flow in one direction only. Diodes are commonly used in electronic circuits to prevent current from flowing in the wrong direction.",
    "also": ["electricity", "electrical"]
  },
  {
    "term": "circuit",
    "html": "A circuit is a closed path of conductive material that allows electricity to flow. A circuit is composed of <em>components</em> that are connected together.",
    "also": ["electricity", "electrical"]
  },
  {
    "term": "open circuit",
    "html": "An open circuit occurs when a gap in the circuit prevents current from flowing. An open circuit can be the result of faulty wiring or a broken component.",
    "also": ["electricity", "electrical"]
  },
  {
    "term": "short circuit",
    "html": "A short circuit occurs when part of a circuit is closed prematurely, preventing current from flowing along the intended path. A short circuit can be the result of faulty wiring or a broken component.",
    "also": ["electricity", "electrical"]
  },
  {
    "term": "closed circuit",
    "html": "A closed circuit occurs when all components in a circuit are connected and electricity flows through the circuit.",
    "also": ["electricity", "electrical"]
  },  
  {
    "term": "electromechanical",
    "html": "The word electromechanical comes from the Latin <em>electro-</em> (meaning <em>electricity</em>) and <em>-mechanic</em> (meaning <em>machine</em> <br><br> Electromechanical <em>computers</em> use a combination of electrical and mechanical components to perform computations."
  },
  {
    "term": ["js", "javascript"],
    "html": "JavaScript is a programming language that is used to develop interactive behavior on the web. JavaScript is a high-level, interpreted language, that is executed by a JavaScript engine (usually the browser).",
    "also": ["programming language", "interpreted language", "interpreter"]
  },
  {
    "term": ["variable", "variable (javascript)"],
    "html": "A variable is one way to store and access data in a program. Think of a variable as a box that holds a value. In JavaScript, declaring a variable begins with the keyword <code>let</code>, followed by the name of the variable.",
    "also": ["javascript", "variable"]
  },
  {
    "term": ["number", "number (javascript)"],
    "html": "A number is a data type that represents a quantity. In JavaScript, a number is a 64-bit IEEE 754 floating point number.",
    "also": ["data type"]
  },
  {
    "term": ["string", "string (javascript)"],
    "html": "A string is a data type that represents a sequence of characters. In JavaScript, a string is a UTF-16 encoded sequence of characters.",
    "also": ["data type", "javascript", "utf"]
  },
  {
    "term": ["boolean", "boolean (javascript)"],
    "html": "A boolean is a data type that can be either <code>true</code> or <code>false</code>.",
    "also": ["data type", "javascript"]
  },
  {
    "term": ["function", "function (javascript)"],
    "html": "A function is a data type that represents a reusable block of code. In JavaScript, a function is a first-class object, meaning it can be assigned to a variable and passed as an argument to other functions.",
    "also": ["data type", "javascript"]
  },
  {
    "term": ["array", "array (javascript)"],
    "html": "An array is a data type that represents a sequence of values. In JavaScript, an array can contain elements of any data type.",
    "also": ["data type", "javascript"]
  },
  {
    "term": ["object", "object (javascript)"],
    "html": "An object is a data type that represents a bundle of both state and behavior. In JavaScript, the properties of an object can be of any data type.",
    "also": ["data type", "javascript"]
  },
  {
    "term": ["undefined", "undefined (javascript)"],
    "html": "The keyword <code>undefined</code> is used by JavaScript to represent the absence of a value.",
    "also": ["data type", "javascript"]
  }, {
    "term": ["integer", "integer (python)"],
    "html": "An integer is a data type that represents a whole number, meaning a number without a fractional part.",
    "also": ["data type", "python"]
  },
  {
    "term": ["float", "float (python)"],
    "html": "A float is a data type that represents a number with a fractional part. In Python, a float is a 64-bit IEEE 754 floating point number.",
    "also": ["data type", "python"]
  },
  {
    "term": ["boolean", "boolean (python)"],
    "html": "A boolean is a data type that can be either <code>True</code> or <code>False</code>.",
    "also": ["data type", "python"]
  },
  {
    "term": ["string", "string (python)"],
    "html": "A string is a data type that represents a sequence of characters. In Python, a string is a UTF-8 encoded sequence of characters.",
    "also": ["data type", "python", "utf"]
  },
  {
    "term": ["list", "list (python)"],
    "html": "A list is a <em>mutable</em> data type that represents a sequence of values. In Python, a list can contain elements of any data type.",
    "also": ["data type", "python"]
  }, 
  {
    "term": ["tuple", "tuple (python)"],
    "html": "A tuple is an <em>immutable</em> data type that represents a sequence of values. In Python, a tuple can contain elements of any data type.",
    "also": ["data type", "python"]
  },
  {
    "term": ["dictionary", "dictionary (python)"],
    "html": "A dictionary is a <em>mutable</em> data type that represents a collection of key-value pairs. In Python, a dictionary can contain elements of any data type.",
    "also": ["data type", "python"]
  },
  {
    "term": ["set", "set (python)"],
    "html": "A set is a <em>mutable</em> data type that represents a collection of unique values. In Python, a set can contain elements of any data type.",
    "also": ["data type", "python"]
  },
  {
    "term": ["function", "function (python)"],
    "html": "A function is a reusable block of code. Think of a function like a recipe that can be defined once and then reused multiple times throughout a program. In Python, a function definition starts with the keyword <code>def</code>.",
    "also": ["programming language", "python"]
  },
  {
    "term": ["lever"],
    "html": "A lever is a simple machine made of a rigid bar that pivots around a point called the fulcrum. It allows a small input force to move a heavier load by increasing mechanical advantage.",
    "also": ["simple machine", "mechanical advantage", "fulcrum"]
  },
  {
    "term": ["wheel and axle", "wheel & axle"],
    "html": "A wheel and axle is a simple machine consisting of a larger wheel attached to a smaller axle so they rotate together. Applying force to the wheel turns the axle, reducing the effort needed to move or lift a load.",
    "also": ["simple machine", "mechanical advantage"]
  },
  {
    "term": ["pulley"],
    "html": "A pulley is a simple machine that uses a grooved wheel and a rope or cable. It changes the direction of force, and when multiple pulleys are combined, they can also reduce the effort needed to lift a load.",
    "also": ["simple machine", "mechanical advantage", "rope"]
  },
  {
    "term": ["inclined plane"],
    "html": "An inclined plane is a flat surface set at an angle. It allows a load to be raised with less force by spreading the work over a longer distance.",
    "also": ["simple machine", "ramp", "mechanical advantage"]
  },
  {
    "term": ["wedge"],
    "html": "A wedge is a simple machine shaped like a triangular block. It converts a force applied to its blunt end into forces that push outward, making it effective for splitting, cutting, or separating materials.",
    "also": ["simple machine", "inclined plane"]
  },
  {
    "term": ["screw"],
    "html": "A screw is a simple machine made of an inclined plane wrapped around a central shaft. Turning the screw converts rotational force into linear force, making it useful for fastening or lifting.",
    "also": ["simple machine", "inclined plane", "thread"]
  },
  {
    "term": ["chain drive"],
    "html": "A chain drive uses a metal chain that meshes with toothed sprockets to transmit power between rotating shafts. It provides a positive, slip-free connection and is suited for high-torque applications.",
    "also": ["power transmission", "sprocket", "rotation"]
  },
  {
    "term": ["belt drive"],
    "html": "A belt drive uses a flexible belt wrapped around pulleys to transfer motion and power. It operates smoothly and quietly, and it can slip under overload, which helps protect the system.",
    "also": ["power transmission", "pulley", "rotation"]
  },
  {
    "term": ["gear drive"],
    "html": "A gear drive uses interlocking gears to transmit motion and force directly from one shaft to another. It offers precise speed and torque control with no slippage, making it effective for high-accuracy systems.",
    "also": ["power transmission", "gears", "torque"]
  },
  {
    "term": ["direct drive"],
    "html": "A direct drive system connects the motor's output shaft directly to the driven component with no belts, chains, or gears in between. This minimizes power loss and mechanical complexity, providing smooth, efficient rotation.",
    "also": ["power transmission", "motor", "rotation"]
  },
  {
    "term": ["hinge joint", "pin joint"],
    "html": "A hinge joint allows rotation around a single axis, like the hinge on a door. It permits angular motion in one plane while restricting other movements.",
    "also": ["mechanical joint", "rotation", "single axis"]
  },
  {
    "term": ["ball and socket joint"],
    "html": "A ball and socket joint consists of a spherical end fitting into a rounded cavity, allowing rotation in multiple directions and a wide range of motion.",
    "also": ["mechanical joint", "rotation", "multi-axis"]
  },
  {
    "term": ["sliding joint", "prismatic joint"],
    "html": "A sliding joint allows linear motion along a single axis, with no rotation. It is commonly used in drawer slides and linear actuators.",
    "also": ["mechanical joint", "linear motion"]
  },
  {
    "term": ["pivot joint"],
    "html": "A pivot joint allows rotation around a single axis, similar to a hinge, but usually for smaller angular movement, like a seesaw pivot.",
    "also": ["mechanical joint", "rotation", "single axis"]
  },
  {
    "term": ["screw joint", "helical joint"],
    "html": "A screw joint converts rotational motion into linear motion through the threads of a screw. It combines rotation and translation along the screw axis.",
    "also": ["mechanical joint", "rotation", "linear motion"]
  },
  {
    "term": ["fixed joint", "rigid joint"],
    "html": "A fixed joint rigidly connects two components so that no relative motion occurs. It is used when parts must move together as a single unit.",
    "also": ["mechanical joint", "rigid connection"]
  },
  {
    "term": ["universal joint", "u-joint"],
    "html": "A universal joint connects two rotating shafts at an angle, allowing torque transmission while accommodating misalignment between shafts.",
    "also": ["mechanical joint", "rotation", "misalignment"]
  },
  {
    "term": ["wheeled locomotion", "wheels"],
    "html": "Wheeled locomotion uses circular wheels that rotate around an axle to move a vehicle or device. It is efficient on flat or gently sloped surfaces and reduces friction compared to sliding.",
    "also": ["rotation", "axle", "terrestrial movement"]
  },
  {
    "term": ["tracked locomotion", "caterpillar tracks"],
    "html": "Tracked locomotion uses continuous tracks, like tank treads, to distribute weight over a larger surface area. This improves traction and allows movement over soft or uneven terrain.",
    "also": ["traction", "terrain adaptation", "terrestrial movement"]
  },
  {
    "term": ["legged locomotion", "walking robots", "quadrupedal robots"],
    "html": "Legged locomotion uses mechanical limbs to move, mimicking walking, running, or hopping. It allows navigation over rough terrain and obstacles that wheeled systems cannot handle.",
    "also": ["bipedal", "quadrupedal", "gait", "terrain adaptation"]
  },
  {
    "term": ["crawling locomotion", "sliding"],
    "html": "Crawling locomotion uses the body of a machine to move by pushing or sliding along a surface, often useful in tight or confined spaces.",
    "also": ["terrestrial movement", "low clearance", "friction"]
  },
  {
    "term": ["rolling locomotion", "rolling robots"],
    "html": "Rolling locomotion moves a machine by rotating its body or part of its body along a surface, reducing energy loss and allowing fast movement on flat surfaces.",
    "also": ["rotation", "terrestrial movement", "circular motion"]
  },
  {
    "term": ["flying locomotion", "aerial robotics", "drones"],
    "html": "Flying locomotion uses lift generated by wings or rotors to move through the air. It allows rapid travel over obstacles and uneven terrain but requires energy to counteract gravity.",
    "also": ["aerial", "lift", "thrust"]
  },
  {
    "term": ["swimming locomotion", "underwater robotics", "propulsion"],
    "html": "Swimming locomotion uses fins, propellers, or body undulation to move through water. It is optimized to overcome drag and achieve efficient propulsion in a fluid environment.",
    "also": ["aquatic", "propulsion", "buoyancy"]
  },
  {
    "term": ["hybrid locomotion", "amphibious vehicles"],
    "html": "Hybrid locomotion combines multiple methods, such as wheels and tracks or wheels and propellers, allowing a machine to move efficiently in different environments.",
    "also": ["multi-terrain", "adaptability", "versatile movement"]
  }
]